In [73]:
import pandas as pd

In [74]:
import numpy as np

In [75]:
diz = {'Nome': 'Vladimir', 'Cognome': 'Putin', 'Occupazione': 'No, semplice visita'}
print(diz)

{'Nome': 'Vladimir', 'Cognome': 'Putin', 'Occupazione': 'No, semplice visita'}

In [76]:
diz = {'Nome':['Antonietta', 'Vladimiro', 'Gionni'], 'Età': [67,3,32]}

In [77]:
df= pd.DataFrame(diz)

In [78]:
df

         Nome  Età
0  Antonietta   67
1   Vladimiro    3
2      Gionni   32

In [79]:
df['Età']

0    67
1     3
2    32
Name: Età, dtype: int64

In [80]:
print(df)

         Nome  Età
0  Antonietta   67
1   Vladimiro    3
2      Gionni   32

In [81]:
# aggiungiamo colonna
df['sesso']=['F', 'M', 'M']

In [82]:
df

         Nome  Età sesso
0  Antonietta   67     F
1   Vladimiro    3     M
2      Gionni   32     M

In [83]:
# accedere a un singolo elemento
df.iloc[0,1]

67

In [84]:
df['Nome'][0]

'Antonietta'

In [85]:
df

         Nome  Età sesso
0  Antonietta   67     F
1   Vladimiro    3     M
2      Gionni   32     M

In [86]:
# posso trasformare una colonna qualsiasi, prenderla e trasformarla in un array
eta2=np.array(df["Età"])+1
df['Età']=eta2

In [87]:
df

         Nome  Età sesso
0  Antonietta   68     F
1   Vladimiro    4     M
2      Gionni   33     M

In [88]:
df.T

                0          1       2
Nome   Antonietta  Vladimiro  Gionni
Età            68          4      33
sesso           F          M       M

In [91]:
ddf=df.T
ddf["3"]=['Ada',44,'F']
df=ddf.T

In [92]:
ddf.T

         Nome Età sesso
0  Antonietta  68     F
1   Vladimiro   4     M
2      Gionni  33     M
3         Ada  44     F

In [93]:
df.sum()

Nome     AntoniettaVladimiroGionniAda
Età                               149
sesso                            FMMF
dtype: object

In [97]:
df.mean()  # non funzia

Series([], dtype: float64)

In [98]:
sum(df['Età'])

149

In [99]:
np.mean(df['Età'])

37.25

In [100]:
df.shape

(4, 3)

In [101]:
df

         Nome Età sesso
0  Antonietta  68     F
1   Vladimiro   4     M
2      Gionni  33     M
3         Ada  44     F

In [103]:
media=sum(df['Età'])/df.shape[0]
print(media)

37.25

In [104]:
df.to_excel("primofile.xls")